{
  "programs": {
    "Email": {
      "priv": [
        "To send an email:",
        "1. Take a piece of paper\n2. Write 'to <user>@<machine> from <user>@<machine>' on top, replacing <user> and <machine> with the actual recipient and sender.\n3. Write a message below\n4. Put the email on the mainframe, with the written side down so that other players cannot read it.\n5. Your turn ends",
        "Note: to 'forward' an email, it is permitted to write a header above the original message."
      ]
    },
    "Phone": {
      "priv": [
        "In normal circumstances, it is not permitted to communicate between players, but this is allowed with the phone program.",
        "1. Announce who you are calling. This person must also have access to the phone.\n2. You can now communicate scenario-information with the person you are calling.\n3. End your turn",
        "Note: Who has a phone is considered public information, so you can ask the other players this information in case of doubt."
      ]
    },
    "Wire cut": {
      "publ": [
        "Disconnect a wire, anywhere on the board.",
        "End your turn"
      ]
    },
    "Connect": {
      "publ": [
        "Connect a wire, anywhere on the board.",
        "If an IP-label is face-down, place it face up again",
        "End your turn"
      ]
    },
    "Email server": {
      "publ": "How to run a mainframe (or email server)?",
      "priv": []
    },
    "Mainframe (IP)": {
      "priv": [
        "0. If a wire is broken, turn the IP-label face-down to indicate a loss in connectivity.",
        "1. If a message reads 'IP-range <range> can be reached via this wire', place a label of the corresponding IP range in the slot of the wire. Place a dice next to it, indicating the number of hops needed",
        "2. If a message reads 'from <ip> to <target-ip>': check all labels. If a label matches the IP-address exactly, send it via this wire.\nIf no exact IP-address match is found, send it via the range-label starting with the same number and which has the lowest number of hops.\n   If not possible, discard the message."
      ]
    },
    "Request IP Range": {
      "priv": ["Take a diamond-shaped range from the ICANN-board; place it into a mainframe.","End your turn"]
    }
  },
  "1": {
    "*": {
      "Setup": {
        "publ": [
          "Place a 'Mainframe'-card in the ARPA-slot. Equip it with the PC-pins\nPlace Alice on 'pc1' and Bob on 'pc2'.",
          "Place collegue-tokens (generic tokens) on all other PC's and on the 'administrator'-spot of the mainframe."
        ],
        "priv": [
          "Needed: D6 (six-sided dice), messages"
        ]
      },
      "colleague": {
        "publ": [
          "Non-player-character\nIf a work-related email ends up with a colleague, then the colleague will send an email back to the sender.",
          "If a love letter ends up with a colleague, unfold and follow the instructions inside"
        ],
        "priv": [
          "If a love-letter ends up with a colleague, roll a six-sided dice.",
          "If 1,2 or 3: this colleague delivers the email to the boss",
          "If 4 or 5: the email is discarded",
          "On 6: This person is very open-minded. They congratulate you on the love and _forward_ the email to the intended recipient. Continue the scenario."
        ],
        "skills": [
          "email",
          "system administrator skills"
        ]
      },
      "Boss": {
        "skills": [
          "phone"
        ],
        "publ": [
          "Non-player character.",
          "To be called via phone in case of irregularities, in which case this card is unfolded"
        ],
        "priv": [
          "If presented with a love letter between two persons, they'll both be fired",
          "If someone sends out fake emails, this person will be fired. The person reporting this behaviour will be awarded the victory point of the fired person."
        ]
      }
    },
    "1": {
      "Alice": {
        "skills": [
          "email"
        ],
        "priv": [
          "You are a woman of colour and you have fallen in love with Bob. He works in a different department, but you'd like to tell him your feelings.",
          "Send a sweet email to Bob to ask him on a date.",
          "After sending the email, you eagerly await a response.",
          "If the date is confirmed, Alice WINS a point in this scenario. Place this card onto your victory pile.\nIf the date is denied, Alice does not win a point. Place your card onto the discard pile.\nIf no response comes within 5 turns, you and Bob lose the scenario and discard both cards."
        ]
      },
      "Bob": {
        "skills": [
          "email"
        ],
        "priv": [
          "You are a hard-working engineer. You don't do anything the first turn.\nWhen you receive an email, send an appropriate answer with the 'email'-program. It is up to you to accept or deny the request in the email!\nIf Alice receives your email, you WIN this scenario."
        ]
      }
    },
    "2": {
      "Story": {
        "publ": "The system administrator has retired; a new administrator is needed. Fold open...",
        "priv": [
          "Everyone with System Administrator Skills who wants can apply, a 'colleague'-NPC will apply as well.",
          "Every applicant rolls a dice, the participant with the highest amount will become the administrator. In case of tie, those winners roll again."
        ]
      },
      "Alice": {
        "skills": [
          "email",
          "phone",
          "system administration skills"
        ],
        "priv": "Send a sweet love letter to Bob during the fourth turn."
      },
      "Bob": {
        "skills": [
          "email",
          "phone"
        ],
        "publ": "To be run by Eve if there are too little players",
        "priv": [
          "Send out a work-related email on the first turn to 'charlie@pc4'.",
          "Wait for emails. ",
          "If you receive a love letter from Alice within 6 turns, Alice and Bob WIN this scenario and can each keep their card. Eve must discard her card.",
          "If no love letter arrives at turn six, this scenario ends NEUTRAL and the cards for Alice and Bob are discarded."
        ]
      },
      "Eve": {
        "skills": [
          "email",
          "phone",
          "system administration skills"
        ],
        "priv": [
          "Your goal is to sabotage the love between Alice & Bob. Ideally, someone causes a lot of drama and get them fired...",
          "Obtaining a love letter is enough proof to call the higher-ups and to get them fired.",
          "If Alice and Bob get fired, you will get both their victory points",
          "If you can sabotage their love, you'll keep this victory point"
        ]
      },
      "Eve - hints": {
        "publ": "No inspiration on how to proceed? Unfold this card for possible options. If not unfolded, Eve will gain this card as extra victory point!",
        "priv": [
          "You have some options:",
          "1) Try to become mainframe administrator, where you can read all emails. You can thus intercept emails from Alice and Bob! Wait for a love letter.",
          "2) You can try to distract Alice when she sends her love letter in the fourth turn. A user error might get the email in the wrong hands...",
          "3) Send a fake email to Alice, telling her that the email address of Bob now is \"bob@pc3\" instead of \"bob@pc2\". If Alice falls for this, you'll soon obtain the love letter she sends.",
          "4) (For advanced players) Try to slow down the mailserver - Bob has only little patience..."
        ]
      }
    }
  },
  "2": {
    "1": {
      "Story": {
        "publ": [
          "Arpanet, Boston University and the NSA want to connect to each other via the internet. This is not straightforward",
          "All three start with setting up IP for their local networks"
        ]
      },
      "Alice": {
        "skills": [
          "request IP range"
        ],
        "publ": "Alice is employee of Arpanet and wants to setup an IP-range for their network",
        "priv": [
          "1. Phone Charlie of 'ICANN', ask him for a range of IP-addresses. Place the IP-address-range into the slot of the mainframe",
          "2. Assign an IP-address to every PC of your mainframe by placing a label in the slot of the corresponding wire.",
          "3. Send an IP-message from your PC to the colleague on your network",
          "If your colleague receives the message, you WIN this scenario"
        ]
      },
      "Bob": {
        "skills": [
          "request IP range"
        ],
        "publ": "Bob is employee of Boston university and wants to setup an IP-range for their network",
        "priv": [
          "1. Phone Charlie of 'ICANN', ask him for a range of IP-addresses. Place the IP-address-range into the slot of the mainframe",
          "2. Assign an IP-address to every PC of your mainframe by placing a label in the slot of the corresponding wire.",
          "3. Send an IP-message from your PC to the colleague on your network",
          "If your colleague receives the message, you WIN this scenario"
        ]
      },
      "Eve": {
        "skills": [
          "request IP range"
        ],
        "publ": "Bob is employee of the National Security Agency (NSA) and wants to setup an IP-range for their network",
        "priv": [
          "1. Phone Charlie of 'ICANN', ask him for a range of IP-addresses. Place the IP-address-range into the slot of the mainframe",
          "2. Assign an IP-address to every PC of your mainframe by placing a label in the slot of the corresponding wire.",
          "3. Send an IP-message from your PC to the colleague on your network",
          "If your colleague receives the message, you WIN this scenario"
        ]
      }
    },
    "2": {
      "Story": {
        "publ": [
          "Time to connect ARPANET with Boston University"
        ]
      },
      "Alice": {
        "priv": [
          "0. Place a wire with a pin in your mainframe, the other (male) side is still loose\n1. Phone Bob from Boston University; ask him if they want to connect via direct wire. Also: ask him his IP-addresss\n2. If Bob agrees, connect the two loose wires.",
          "If a wire gets connected, send a message with text 'BGP-announcement: IP-range <your range here> can be reached via this wire in 1 hop' and send it via the wire.",
          "3. Send an IP-message to the IP-address of Bob (you asked this in the phone earlier. If you've forgotten it, call again)\n4. Wait for a reply; if a reply arrives, you have WON this scenario"
        ]
      },
      "Bob": {
        "priv": [
          "Place a wire with a pin in your mainframe. The other (female) end is still loose.",
          "If Alice calls you, agree with her proposal.",
          "If a wire gets connected, send a message with text 'BGP-announcement: IP-range <your range here> can be reached via this wire in 1 hop' and send it via the wire.",
          "When you get an IP-message, send some answer. You WIN this scenario."
        ]
      }
    },
    "3": {
      "Story": {
        "priv": [
          "Now that ARPANet and Boston University are connected, they can start their secret research.",
          "But the NSA would like to snoop on the research too, and maybe sabotage it..."
        ]
      },
      "Alice": {
      },
      "Bob": {
      },
      "Eve": {
        "priv": [
          "Eve wants to know what research messages are sent between Arpanet and Boston university.",
          "She wants to:\n Know _which_ employees are sending messages to each other?\n- Know _what_ do these messages say?\n- alter some of those messages..."
        ]
      }
    }
  }
}